/*
Наша команда зіграла 10 матчів у чемпіонаті, і результати кожного матчу записані у вигляді рядка "x:y",
де x — це кількість голів нашої команди, а y — кількість голів супротивника.
Потрібно підрахувати загальну кількість балів за такими правилами:

3 бали за перемогу (x > y)
1 бал за нічию (x === y)
0 балів за поразку (x < y)

Задача — написати функцію, яка обчислює загальну кількість балів нашої команди після 10 матчів.*/

function points(games) {
    let points = 0;

    for (let i = 0; i < games.length; i++) {
        const [x, y] = games[i].split(':').map(Number)
        if (x > y) points += 3;
        if (x < y) points += 0;
        if (x === y) points += 1;
    }

    return points;
}

console.log(points(["1:0","2:0","3:0","4:0","2:1","3:1","4:1","3:2","4:2","4:3"]));